DataProcessors/бит_ВыгрузкаОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ВыгрузкаОплат</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/лб_ПредставлниеЗданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_ПредставлниеЗданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_НаправленияОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПениПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/бит_ВыгрузкаОплат/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Разделитель = ";";
	СпособДетализации = 1;
	ЗаполнитьНачисления();
	ЗаполнитьУчастки();
	ЗаполнитьТипыКвартир();
	ЗаполнитьВидыОплат();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисления()
	
	Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_УслугиЖКХ.Ссылка КАК Начисление
		|ИЗ
		|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
		|ГДЕ
		|	НЕ бит_УслугиЖКХ.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_УслугиЖКХ.Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаНачисления = Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНачисления, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчастки()
	
	Участки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_АдминистративныеОкруга.Ссылка КАК Участок
		|ИЗ
		|	Справочник.бит_АдминистративныеОкруга КАК бит_АдминистративныеОкруга
		|ГДЕ
		|	НЕ бит_АдминистративныеОкруга.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_АдминистративныеОкруга.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаУчастки = Участки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУчастки, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыКвартир()
	
	ТипыКвартир.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ТипыКвартиры.Ссылка КАК ТипКвартиры
		|ИЗ
		|	Справочник.бит_ТипыКвартиры КАК бит_ТипыКвартиры
		|ГДЕ
		|	НЕ бит_ТипыКвартиры.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ТипыКвартиры.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаТК = ТипыКвартир.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТК, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыОплат()
	
	ВидыОплат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_ВидыОплат.Ссылка КАК ВидОплаты
		|ИЗ
		|	Справочник.лб_ВидыОплат КАК лб_ВидыОплат
		|ГДЕ
		|	НЕ лб_ВидыОплат.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	лб_ВидыОплат.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаВО = ВидыОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаВО, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталогаИмпорта = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогаИмпорта.Заголовок = "Выберите каталог для выгрузки ";
	ДиалогВыбораКаталогаИмпорта.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогаИмпорта.Каталог = Каталог;
	
	Оповещение = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	ДиалогВыбораКаталогаИмпорта.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Каталог = Результат[0];
	Иначе
		ПоказатьПредупреждение(,"Каталог не выбран!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", НачалоПериода, КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РезультатВыбора, "НачалоПериода,КонецПериода");

КонецПроцедуры

&НаКлиенте
Процедура Начисления_УстановитьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Начисления_СнятьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_УстановитьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_СнятьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_УстановитьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_СнятьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлCSV(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		Сообщить("Не заполнен каталог!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		Сообщить("Не заполнено начало периода!");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		Сообщить("Не заполнен конец периода!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не заполнена организация!");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеНаСервере();
	//Если Не ТаблицаИтог.Количество() = 0 Тогда
		СформироватьФайлCSVНаКлиенте();	
	//Иначе	
	//	Сообщить("Не найдены данные для сохранения в файл csv!");	
	//КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.Период) КАК Период,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира
	|ПОМЕСТИТЬ ВТ_ДатыКвартир
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ) КАК бит_СведенияОКвартиреСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыКвартир.Квартира КАК Квартира
	|ПОМЕСТИТЬ ВТ_КвартирыПоТипу
	|ИЗ
	|	ВТ_ДатыКвартир КАК ВТ_ДатыКвартир
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
	|		ПО ВТ_ДатыКвартир.Период = бит_СведенияОКвартире.Период
	|			И ВТ_ДатыКвартир.Квартира = бит_СведенияОКвартире.Квартира
	|ГДЕ
	|	бит_СведенияОКвартире.ТипКвартиры В(&ТипыКвартир)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК LS,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Услуга,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор КАК Ссылка,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.НомерСтроки КАК НомерСтроки,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодСекунда КАК Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодМесяц КАК PER,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаРасход КАК Сумма,
	|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК F,
	|	ВЫБОР
	|		КОГДА бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры ЕСТЬ NULL
	|				ИЛИ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры = """"
	|			ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира
	|		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры
	|	КОНЕЦ КАК NKV,
	|	ЕСТЬNULL(лб_ПредставлниеЗданий.Представление, бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание) КАК ADR,
	|	ЕСТЬNULL(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.лб_ВидОплаты, ЗНАЧЕНИЕ(Справочник.лб_ВидыОплат.ОплатаЖильцов)) КАК VID,
	|	0 КАК СуммаПени
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И 1 = 1
	|				И ЛицевойСчет.Здание.Район В (&Участки)
	|				И ЛицевойСчет.Квартира В
	|					(ВЫБРАТЬ
	|						ВТ_КвартирыПоТипу.Квартира КАК Квартира
	|					ИЗ
	|						ВТ_КвартирыПоТипу КАК ВТ_КвартирыПоТипу)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_ПредставлниеЗданий КАК лб_ПредставлниеЗданий
	|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание = лб_ПредставлниеЗданий.Здание
	|ГДЕ
	|	НЕ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
	|				ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндексаОбщедомовыхЗатрат
	|				ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам)
	|	И ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.ОперацияБух
	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.лб_ВидОплаты В (&ВидыОплаты)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
	|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.НомерСтроки,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ПериодСекунда,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ПериодМесяц,
	|	0,
	|	ВЫРАЗИТЬ(бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга),
	|	ВЫБОР
	|		КОГДА бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры ЕСТЬ NULL
	|				ИЛИ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры = """"
	|			ТОГДА бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Квартира
	|		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры
	|	КОНЕЦ,
	|	ЕСТЬNULL(лб_ПредставлниеЗданий.Представление, бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Здание),
	|	ЕСТЬNULL(бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор.лб_ВидОплаты, ЗНАЧЕНИЕ(Справочник.лб_ВидыОплат.ОплатаЖильцов)),
	|	бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениРасход
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Организация = &Организация
	|				И УслугаЖКХ В (&Начисления)
	|				И 1 = 1
	|				И ЛицевойСчет.Здание.Район В (&Участки)
	|				И ЛицевойСчет.Квартира В
	|					(ВЫБРАТЬ
	|						ВТ_КвартирыПоТипу.Квартира КАК Квартира
	|					ИЗ
	|						ВТ_КвартирыПоТипу КАК ВТ_КвартирыПоТипу)) КАК бит_НачислениеПениПоУслугамЖКХОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_ПредставлниеЗданий КАК лб_ПредставлниеЗданий
	|		ПО бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Здание = лб_ПредставлниеЗданий.Здание
	|ГДЕ
	|	ВЫБОР
	|			КОГДА бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					ИЛИ бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					ИЛИ бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПениПоКУ
	|				ТОГДА бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор.лб_ВидОплаты В (&ВидыОплаты)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.Период КАК Период,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства
	|ПОМЕСТИТЬ ВТ_ПредФИО
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&ДатаОкончания,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_Данные.LS КАК LS
	|				ИЗ
	|					ВТ_Данные КАК ВТ_Данные)) КАК бит_ПроживающиеПоЛССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ПредФИО.Период) КАК Период,
	|	ВТ_ПредФИО.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ПредФИО.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТ_ФИО
	|ИЗ
	|	ВТ_ПредФИО КАК ВТ_ПредФИО
	|ГДЕ
	|	НЕ ВТ_ПредФИО.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|	И ВТ_ПредФИО.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПредФИО.ЛицевойСчет,
	|	ВТ_ПредФИО.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Услуга КАК Услуга,
	|	ЕСТЬNULL(бит_ОплатаКУСписокЛС.лб_ПериодНачисления, ВТ_Данные.PER) КАК PER,
	|	ВТ_Данные.Сумма КАК Сумма,
	|	ВТ_Данные.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(бит_ОплатаКУСписокЛС.лб_Примечание, """") КАК PRI,
	|	ВТ_Данные.F КАК F,
	|	ВТ_Данные.LS КАК LS,
	|	ВТ_Данные.NKV КАК NKV,
	|	ВТ_Данные.ADR КАК ADR,
	|	ВТ_Данные.VID КАК VID,
	|	ВТ_Данные.Период КАК Период,
	|	бит_ОплатаКУСписокУслуг.лб_КлючСтроки КАК лб_КлючСтроки,
	|	ВТ_Данные.НомерСтроки КАК НомерСтроки,
	|	ВТ_ФИО.ФизЛицо КАК FIO,
	|	ВТ_Данные.СуммаПени КАК СуммаПени
	
	//09.01.2023 Дмитрий Мурас - Начало доработки
	//Задача 8687 - Некорректная выгрузка периода оплаты в Выгрузке информации об оплатах по услугам
	
	//Было:

	 //|ПОМЕСТИТЬ ВТ_Документы
	 //|ИЗ
	 //|	ВТ_Данные КАК ВТ_Данные
	 //|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
	 //|		ПО ВТ_Данные.Ссылка = бит_ОплатаКУСписокЛС.Ссылка
	 //|			И ВТ_Данные.LS = бит_ОплатаКУСписокЛС.ЛицевойСчет
	 //|			И ВТ_Данные.НомерСтроки = бит_ОплатаКУСписокЛС.НомерСтроки
	 //|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИО КАК ВТ_ФИО
	 //|		ПО ВТ_Данные.LS = ВТ_ФИО.ЛицевойСчет
	 //|;
	 
	 //Стало:
	
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИО КАК ВТ_ФИО
	|		ПО ВТ_Данные.LS = ВТ_ФИО.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
	|		ПО ВТ_Данные.Ссылка = бит_ОплатаКУСписокУслуг.Ссылка
	|			И ВТ_Данные.НомерСтроки = бит_ОплатаКУСписокУслуг.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
	|		ПО ВТ_Данные.Ссылка = бит_ОплатаКУСписокЛС.Ссылка
	|			И (бит_ОплатаКУСписокУслуг.лб_КлючСтроки = бит_ОплатаКУСписокЛС.НомерСтроки)
	|;
	
	//09.01.2023 Дмитрий Мурас - Конец доработки
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.F КАК F,
	|	ВТ_Документы.LS КАК LS,
	|	ВТ_Документы.NKV КАК NKV,
	|	ВТ_Документы.ADR КАК ADR,
	|	ВТ_Документы.VID КАК VID,
	|	ВТ_Документы.Период КАК MES,
	|	ВТ_Документы.PER КАК PER,
	|	ВТ_Документы.Период КАК DEN,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &SOD_J
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК SOD_J,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &DM_J
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК DM_J,
	|   0 КАК A_J,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &DOP_JY
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК DOP_JY,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга В (&P_J)
	|			ТОГДА ВТ_Документы.СуммаПени
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК P_J,
	|   0 КАК G_J,
	|	0 КАК G_PENI,
	|	0 КАК GV_J,
	|	0 КАК OT_J,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &PR
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК PR,
	|	0 КАК XV_J,
	|	0 КАК VO_J,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &GP_JY
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК GP_JY,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &PREDS
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК PREDS,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &KAP_DOP
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК KAP_DOP,    
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &KAP_ORG
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК KAP_ORG,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &KAP_MIN
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК KAP_MIN,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &KAP_MIN
	|				И НЕ ВТ_Документы.СуммаПени = 0
	|			ТОГДА ВТ_Документы.СуммаПени
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК KAP_P,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &RFRK
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК RFRK,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &ODN_VO
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ODN_VO,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &ODN_GV
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ODN_GV,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &ODN_XV
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ODN_XV,
	|	ВЫБОР
	|		КОГДА ВТ_Документы.Услуга = &ODN_EL
	|			ТОГДА ВТ_Документы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ODN_EL,
	|	9 КАК B,
	|	0 КАК KOD_A,
	|	0 КАК KOD_T,
	|	ВТ_Документы.PRI КАК PRI,
	|	ВТ_Документы.НомерСтроки КАК НомерСтроки,
	|	ВТ_Документы.Ссылка КАК Ссылка,
	|	ВТ_Документы.FIO КАК FIO
	|ПОМЕСТИТЬ ВТ_ПоУслугам
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоУслугам.F КАК F,
	|	ВТ_ПоУслугам.LS КАК LS,
	|	ВТ_ПоУслугам.NKV КАК NKV,
	|	ВТ_ПоУслугам.ADR КАК ADR,
	|	ВТ_ПоУслугам.VID КАК VID,
	|	ВТ_ПоУслугам.MES КАК MES,
	|	ВТ_ПоУслугам.PER КАК PER,
	|	ВТ_ПоУслугам.DEN КАК DEN,
	|	СУММА(ВТ_ПоУслугам.SOD_J) КАК SOD_J,
	|	СУММА(ВТ_ПоУслугам.DM_J) КАК DM_J,
	|	СУММА(ВТ_ПоУслугам.A_J) КАК A_J,
	|	СУММА(ВТ_ПоУслугам.DOP_JY) КАК DOP_JY,
	|	СУММА(ВТ_ПоУслугам.P_J) КАК P_J,
	|	СУММА(ВТ_ПоУслугам.G_J) КАК G_J,
	|	СУММА(ВТ_ПоУслугам.G_PENI) КАК G_PENI,
	|	СУММА(ВТ_ПоУслугам.GV_J) КАК GV_J,
	|	СУММА(ВТ_ПоУслугам.OT_J) КАК OT_J,
	|	СУММА(ВТ_ПоУслугам.PR) КАК PR,
	|	СУММА(ВТ_ПоУслугам.XV_J) КАК XV_J,
	|	СУММА(ВТ_ПоУслугам.VO_J) КАК VO_J,
	|	СУММА(ВТ_ПоУслугам.GP_JY) КАК GP_JY,
	|	СУММА(ВТ_ПоУслугам.PREDS) КАК PREDS,
	|	СУММА(ВТ_ПоУслугам.KAP_DOP) КАК KAP_DOP,              
	|	СУММА(ВТ_ПоУслугам.KAP_ORG) КАК KAP_ORG, 
	|	СУММА(ВТ_ПоУслугам.KAP_MIN) КАК KAP_MIN,
	|	СУММА(ВТ_ПоУслугам.KAP_P) КАК KAP_P,
	|	СУММА(ВТ_ПоУслугам.RFRK) КАК RFRK,
	|	СУММА(ВТ_ПоУслугам.ODN_VO) КАК ODN_VO,
	|	СУММА(ВТ_ПоУслугам.ODN_GV) КАК ODN_GV,
	|	СУММА(ВТ_ПоУслугам.ODN_XV) КАК ODN_XV,
	|	СУММА(ВТ_ПоУслугам.ODN_EL) КАК ODN_EL,
	|	ВТ_ПоУслугам.B КАК B,
	|	МАКСИМУМ(ВТ_ПоУслугам.KOD_T) КАК KOD_T,
	|	МАКСИМУМ(ВТ_ПоУслугам.KOD_A) КАК KOD_A,
	|	ВТ_ПоУслугам.PRI КАК PRI,
	|	ВТ_ПоУслугам.Ссылка КАК Ссылка,
	|	ВТ_ПоУслугам.FIO КАК FIO
	|ИЗ
	|	ВТ_ПоУслугам КАК ВТ_ПоУслугам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоУслугам.F,
	|	ВТ_ПоУслугам.LS,
	|	ВТ_ПоУслугам.NKV,
	|	ВТ_ПоУслугам.ADR,
	|	ВТ_ПоУслугам.VID,
	|	ВТ_ПоУслугам.MES,
	|	ВТ_ПоУслугам.DEN,
	|	ВТ_ПоУслугам.B,
	|	ВТ_ПоУслугам.PRI,
	|	ВТ_ПоУслугам.PER,
	|	ВТ_ПоУслугам.Ссылка,
	|	ВТ_ПоУслугам.FIO
	|
	|УПОРЯДОЧИТЬ ПО
	|	F,
	|	LS,
	|	NKV,
	|	PER";
	

		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	МАКСИМУМ(бит_СведенияОКвартиреСрезПоследних.Период) КАК Период,
		//|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира
		//|ПОМЕСТИТЬ ВТ_ДатыКвартир
		//|ИЗ
		//|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ) КАК бит_СведенияОКвартиреСрезПоследних
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	бит_СведенияОКвартиреСрезПоследних.Квартира
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ДатыКвартир.Квартира КАК Квартира
		//|ПОМЕСТИТЬ ВТ_КвартирыПоТипу
		//|ИЗ
		//|	ВТ_ДатыКвартир КАК ВТ_ДатыКвартир
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
		//|		ПО ВТ_ДатыКвартир.Период = бит_СведенияОКвартире.Период
		//|			И ВТ_ДатыКвартир.Квартира = бит_СведенияОКвартире.Квартира
		//|ГДЕ
		//|	бит_СведенияОКвартире.ТипКвартиры В(&ТипыКвартир)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК LS,
		//|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Услуга,
		//|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор КАК Ссылка,
		//|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.НомерСтроки КАК НомерСтроки,
		//|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодСекунда КАК Период,
		//|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодМесяц КАК PER,
		//|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаРасход КАК Сумма,
		//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК F,
		//|	ВЫБОР
		//|		КОГДА бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры ЕСТЬ NULL
		//|				ИЛИ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры = """"
		//|			ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира
		//|		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры
		//|	КОНЕЦ КАК NKV,
		//|	ЕСТЬNULL(лб_ПредставлниеЗданий.Представление, бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание) КАК ADR,
		//|	ЕСТЬNULL(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.лб_ВидОплаты, ЗНАЧЕНИЕ(Справочник.лб_ВидыОплат.ОплатаЖильцов)) КАК VID,
		//|	0 КАК СуммаПени
		//|ПОМЕСТИТЬ ВТ_Данные
		//|ИЗ
		//|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
		//|			&ДатаНачала,
		//|			&ДатаОкончания,
		//|			Авто,
		//|			Организация = &Организация
		//|				И УслугаЖКХ В (&Начисления)
		//|				И 1 = 1
		//|				И ЛицевойСчет.Здание.Район В (&Участки)
		//|				И ЛицевойСчет.Квартира В
		//|					(ВЫБРАТЬ
		//|						ВТ_КвартирыПоТипу.Квартира КАК Квартира
		//|					ИЗ
		//|						ВТ_КвартирыПоТипу КАК ВТ_КвартирыПоТипу)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
		//|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_ПредставлниеЗданий КАК лб_ПредставлниеЗданий
		//|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание = лб_ПредставлниеЗданий.Здание
		//|ГДЕ
		//|	НЕ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
		//|				ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
		//|				ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндексаОбщедомовыхЗатрат
		//|				ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
		//|				ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам)
		//|	И ВЫБОР
		//|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		//|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		//|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.ОперацияБух
		//|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.лб_ВидОплаты В (&ВидыОплаты)
		//|			ИНАЧЕ ИСТИНА
		//|		КОНЕЦ
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВЫРАЗИТЬ(бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
		//|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ,
		//|	бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор,
		//|	бит_НачислениеПениПоУслугамЖКХОбороты.НомерСтроки,
		//|	бит_НачислениеПениПоУслугамЖКХОбороты.ПериодСекунда,
		//|	бит_НачислениеПениПоУслугамЖКХОбороты.ПериодМесяц,
		//|	0,
		//|	ВЫРАЗИТЬ(бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга),
		//|	ВЫБОР
		//|		КОГДА бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры ЕСТЬ NULL
		//|				ИЛИ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры = """"
		//|			ТОГДА бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Квартира
		//|		ИНАЧЕ бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры
		//|	КОНЕЦ,
		//|	ЕСТЬNULL(лб_ПредставлниеЗданий.Представление, бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Здание),
		//|	ЕСТЬNULL(бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор.лб_ВидОплаты, ЗНАЧЕНИЕ(Справочник.лб_ВидыОплат.ОплатаЖильцов)),
		//|	бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениРасход
		//|ИЗ
		//|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
		//|			&ДатаНачала,
		//|			&ДатаОкончания,
		//|			Авто,
		//|			Организация = &Организация
		//|				И УслугаЖКХ В (&Начисления)
		//|				И 1 = 1
		//|				И ЛицевойСчет.Здание.Район В (&Участки)
		//|				И ЛицевойСчет.Квартира В
		//|					(ВЫБРАТЬ
		//|						ВТ_КвартирыПоТипу.Квартира КАК Квартира
		//|					ИЗ
		//|						ВТ_КвартирыПоТипу КАК ВТ_КвартирыПоТипу)) КАК бит_НачислениеПениПоУслугамЖКХОбороты
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
		//|		ПО бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_ПредставлниеЗданий КАК лб_ПредставлниеЗданий
		//|		ПО бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет.Здание = лб_ПредставлниеЗданий.Здание
		//|ГДЕ
		//|	ВЫБОР
		//|			КОГДА бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		//|					ИЛИ бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		//|					ИЛИ бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПениПоКУ
		//|				ТОГДА бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор.лб_ВидОплаты В (&ВидыОплаты)
		//|			ИНАЧЕ ИСТИНА
		//|		КОНЕЦ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	бит_ПроживающиеПоЛССрезПоследних.Период КАК Период,
		//|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		//|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
		//|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
		//|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства
		//|ПОМЕСТИТЬ ВТ_ПредФИО
		//|ИЗ
		//|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		//|			&ДатаОкончания,
		//|			ЛицевойСчет В
		//|				(ВЫБРАТЬ
		//|					ВТ_Данные.LS КАК LS
		//|				ИЗ
		//|					ВТ_Данные КАК ВТ_Данные)) КАК бит_ПроживающиеПоЛССрезПоследних
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	МАКСИМУМ(ВТ_ПредФИО.Период) КАК Период,
		//|	ВТ_ПредФИО.ЛицевойСчет КАК ЛицевойСчет,
		//|	ВТ_ПредФИО.ФизЛицо КАК ФизЛицо
		//|ПОМЕСТИТЬ ВТ_ФИО
		//|ИЗ
		//|	ВТ_ПредФИО КАК ВТ_ПредФИО
		//|ГДЕ
		//|	НЕ ВТ_ПредФИО.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
		//|	И ВТ_ПредФИО.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ПредФИО.ЛицевойСчет,
		//|	ВТ_ПредФИО.ФизЛицо
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Данные.Услуга КАК Услуга,
		//|	ВТ_Данные.PER КАК PER,
		//|	ВТ_Данные.Сумма КАК Сумма,
		//|	ВТ_Данные.Ссылка КАК Ссылка,
		//|	ЕСТЬNULL(бит_ОплатаКУСписокЛС.лб_Примечание, """") КАК PRI,
		//|	ВТ_Данные.F КАК F,
		//|	ВТ_Данные.LS КАК LS,
		//|	ВТ_Данные.NKV КАК NKV,
		//|	ВТ_Данные.ADR КАК ADR,
		//|	ВТ_Данные.VID КАК VID,
		//|	ВТ_Данные.Период КАК Период,
		//|	ВТ_Данные.НомерСтроки КАК НомерСтроки,
		//|	ВТ_ФИО.ФизЛицо КАК FIO,
		//|	ВТ_Данные.СуммаПени КАК СуммаПени
		//|ПОМЕСТИТЬ ВТ_Документы
		//|ИЗ
		//|	ВТ_Данные КАК ВТ_Данные
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
		//|		ПО ВТ_Данные.Ссылка = бит_ОплатаКУСписокЛС.Ссылка
		//|			И ВТ_Данные.LS = бит_ОплатаКУСписокЛС.ЛицевойСчет
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИО КАК ВТ_ФИО
		//|		ПО ВТ_Данные.LS = ВТ_ФИО.ЛицевойСчет
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Документы.F КАК F,
		//|	ВТ_Документы.LS КАК LS,
		//|	ВТ_Документы.NKV КАК NKV,
		//|	ВТ_Документы.ADR КАК ADR,
		//|	ВТ_Документы.VID КАК VID,
		//|	ВТ_Документы.Период КАК MES,
		//|	ВТ_Документы.PER КАК PER,
		//|	ВТ_Документы.Период КАК DEN,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &SOD_J
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК SOD_J,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &DM_J
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК DM_J,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга В (&A_J)
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК A_J,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &DOP_JY
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК DOP_JY,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга В (&P_J)
		//|			ТОГДА ВТ_Документы.СуммаПени
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК P_J,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &G_J
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК G_J,
		//|	0 КАК G_PENI,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга В (&GV_J)
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК GV_J,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга В (&OT_J)
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК OT_J,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &PR
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК PR,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга В (&XV_J)
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК XV_J,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &VO_J
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК VO_J,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &GP_JY
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК GP_JY,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &PREDS
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК PREDS,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &KAP_DOP
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК KAP_DOP,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &KAP_MIN
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК KAP_MIN,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &KAP_MIN
		//|				И НЕ ВТ_Документы.СуммаПени = 0
		//|			ТОГДА ВТ_Документы.СуммаПени
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК KAP_P,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &RFRK
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК RFRK,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &ODN_VO
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК ODN_VO,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &ODN_GV
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК ODN_GV,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &ODN_XV
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК ODN_XV,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &ODN_EL
		//|			ТОГДА ВТ_Документы.Сумма
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК ODN_EL,
		//|	9 КАК B,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &ААС
		//|			ТОГДА 1
		//|		КОГДА ВТ_Документы.Услуга = &АПТ
		//|			ТОГДА 7
		//|		КОГДА ВТ_Документы.Услуга = &АГТ
		//|			ТОГДА 6
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК KOD_A,
		//|	ВЫБОР
		//|		КОГДА ВТ_Документы.Услуга = &ОтоплениеОКСК
		//|			ТОГДА 4
		//|		КОГДА ВТ_Документы.Услуга = &ОбслуживаниеПУ
		//|			ТОГДА 5
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК KOD_T,
		//|	ВТ_Документы.PRI КАК PRI,
		//|	ВТ_Документы.НомерСтроки КАК НомерСтроки,
		//|	ВТ_Документы.Ссылка КАК Ссылка,
		//|	ВТ_Документы.FIO КАК FIO
		//|ПОМЕСТИТЬ ВТ_ПоУслугам
		//|ИЗ
		//|	ВТ_Документы КАК ВТ_Документы
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ПоУслугам.F КАК F,
		//|	ВТ_ПоУслугам.LS КАК LS,
		//|	ВТ_ПоУслугам.NKV КАК NKV,
		//|	ВТ_ПоУслугам.ADR КАК ADR,
		//|	ВТ_ПоУслугам.VID КАК VID,
		//|	ВТ_ПоУслугам.MES КАК MES,
		//|	ВТ_ПоУслугам.PER КАК PER,
		//|	ВТ_ПоУслугам.DEN КАК DEN,
		//|	СУММА(ВТ_ПоУслугам.SOD_J) КАК SOD_J,
		//|	СУММА(ВТ_ПоУслугам.DM_J) КАК DM_J,
		//|	СУММА(ВТ_ПоУслугам.A_J) КАК A_J,
		//|	СУММА(ВТ_ПоУслугам.DOP_JY) КАК DOP_JY,
		//|	СУММА(ВТ_ПоУслугам.P_J) КАК P_J,
		//|	СУММА(ВТ_ПоУслугам.G_J) КАК G_J,
		//|	СУММА(ВТ_ПоУслугам.G_PENI) КАК G_PENI,
		//|	СУММА(ВТ_ПоУслугам.GV_J) КАК GV_J,
		//|	СУММА(ВТ_ПоУслугам.OT_J) КАК OT_J,
		//|	СУММА(ВТ_ПоУслугам.PR) КАК PR,
		//|	СУММА(ВТ_ПоУслугам.XV_J) КАК XV_J,
		//|	СУММА(ВТ_ПоУслугам.VO_J) КАК VO_J,
		//|	СУММА(ВТ_ПоУслугам.GP_JY) КАК GP_JY,
		//|	СУММА(ВТ_ПоУслугам.PREDS) КАК PREDS,
		//|	СУММА(ВТ_ПоУслугам.KAP_DOP) КАК KAP_DOP,
		//|	СУММА(ВТ_ПоУслугам.KAP_MIN) КАК KAP_MIN,
		//|	СУММА(ВТ_ПоУслугам.KAP_P) КАК KAP_P,
		//|	СУММА(ВТ_ПоУслугам.RFRK) КАК RFRK,
		//|	СУММА(ВТ_ПоУслугам.ODN_VO) КАК ODN_VO,
		//|	СУММА(ВТ_ПоУслугам.ODN_GV) КАК ODN_GV,
		//|	СУММА(ВТ_ПоУслугам.ODN_XV) КАК ODN_XV,
		//|	СУММА(ВТ_ПоУслугам.ODN_EL) КАК ODN_EL,
		//|	ВТ_ПоУслугам.B КАК B,
		//|	МАКСИМУМ(ВТ_ПоУслугам.KOD_T) КАК KOD_T,
		//|	МАКСИМУМ(ВТ_ПоУслугам.KOD_A) КАК KOD_A,
		//|	ВТ_ПоУслугам.PRI КАК PRI,
		//|	ВТ_ПоУслугам.Ссылка КАК Ссылка,
		//|	ВТ_ПоУслугам.FIO КАК FIO
		//|ИЗ
		//|	ВТ_ПоУслугам КАК ВТ_ПоУслугам
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ПоУслугам.F,
		//|	ВТ_ПоУслугам.LS,
		//|	ВТ_ПоУслугам.NKV,
		//|	ВТ_ПоУслугам.ADR,
		//|	ВТ_ПоУслугам.VID,
		//|	ВТ_ПоУслугам.MES,
		//|	ВТ_ПоУслугам.DEN,
		//|	ВТ_ПоУслугам.B,
		//|	ВТ_ПоУслугам.PRI,
		//|	ВТ_ПоУслугам.PER,
		//|	ВТ_ПоУслугам.Ссылка,
		//|	ВТ_ПоУслугам.FIO
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	F,
		//|	LS,
		//|	NKV,
		//|	PER";
	
	МассивНачислений = ПолучитьМассивНачислений();
	МассивУчастков = ПолучитьМассивУчастков();
	МассивАдресов = ПолучитьМассивАдресов();
	МассивТиповКвартир = ПолучитьМассивТиповКвартир();
	ВидыОплаты = ПолучитьМассивВидовОплат();
	
	A_J = Новый Массив;
	A_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000013"));
	A_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000020"));
	A_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000019"));
	
	GV_J = Новый Массив;
	GV_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000006"));
	GV_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000024"));
	
	OT_J = Новый Массив;
	OT_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000005"));
	OT_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000025"));
	
	XV_J = Новый Массив;
	XV_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000002"));
	XV_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000023"));
	
	P_J = новый Массив;
	P_J.Добавить(Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001"));
	
	Запрос.УстановитьПараметр("DM_J", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000006"));
	Запрос.УстановитьПараметр("DOP_JY", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000007"));    
	Запрос.УстановитьПараметр("ORG", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000011"));    
	Запрос.УстановитьПараметр("GP_JY", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012"));
	Запрос.УстановитьПараметр("KAP_DOP", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000014"));   
	Запрос.УстановитьПараметр("KAP_ORG", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000011"));   
	Запрос.УстановитьПараметр("KAP_MIN", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010"));
	Запрос.УстановитьПараметр("KAP_P", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000010"));
	Запрос.УстановитьПараметр("ODN_EL", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000002"));
	Запрос.УстановитьПараметр("ODN_GV", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000003"));
	Запрос.УстановитьПараметр("ODN_VO", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000005"));
	Запрос.УстановитьПараметр("ODN_XV", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000004"));
	Запрос.УстановитьПараметр("P_J", P_J);
	Запрос.УстановитьПараметр("PR", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000008"));
	Запрос.УстановитьПараметр("PREDS", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000013"));
	Запрос.УстановитьПараметр("RFRK", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000009"));
	Запрос.УстановитьПараметр("SOD_J", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000001"));
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Начисления", МассивНачислений);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Участки", МассивУчастков);
	Запрос.УстановитьПараметр("ТипыКвартир", МассивТиповКвартир);
	Запрос.УстановитьПараметр("ВидыОплаты", ВидыОплаты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьШапка);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлCSVНаКлиенте()
	
	ПолноеИмяФайла = Каталог + "\" + Формат(ТекущаяДата(),"ДФ='dd-MM-yyyy HH.mm.ss'") + ".xlsx";
	//ИмяВременногоФайла = КаталогВременныхФайлов() + Новый УникальныйИдентификатор + ".csv";  
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ПолноеИмяФайла = Каталог + "\" + ИмяФайла + ".xlsx";	
	КонецЕсли; 
	
	Попытка
		
		//Кодировка = КодировкаТекста.Системная;
		//ТекстовыйФайлЗапись = Новый ЗаписьТекста(ИмяВременногоФайла, Кодировка);
		//
		//СтрокаШапки = "Период;Услуга;АналитикаУчета;+;-;Знаковое;НачисленоСИзменениями;Изменение;НачисленоЗаПериод;ОплаченоЗаПериод;+;-;Знаковое";
		//ТекстовыйФайлЗапись.ЗаписатьСтроку(СтрокаШапки);
		//
		//Для каждого Строка Из ТаблицаИтог Цикл
		//	ТекстовыйДокумент = "";
		//	
		//	ТекстовыйДокумент = ТекстовыйДокумент + 
		//						Формат(Строка.Период, "ДЛФ=D") + Разделитель + 
		//						Строка.Начисление + Разделитель + 
		//						Строка.АналитикаУчета + Разделитель +
		//						Формат(Строка.НачалоНачислено, "ЧГ=0") + Разделитель +
		//						Формат(Строка.НачалоОплачено, "ЧГ=0") + Разделитель +
		//						Формат(Строка.ИтогоНачало, "ЧГ=0") + Разделитель +
		//						Формат(Строка.НачисленоСИзменениями, "ЧГ=0") + Разделитель +
		//						Формат(Строка.Изменение, "ЧГ=0") + Разделитель +
		//						Формат(Строка.НачисленоОборот, "ЧГ=0") + Разделитель +
		//						Формат(Строка.Оплачено, "ЧГ=0") + Разделитель +
		//						Формат(Строка.КонецНачислено, "ЧГ=0") + Разделитель + 
		//						Формат(Строка.КонецОплачено, "ЧГ=0") + Разделитель + 
		//						Формат(Строка.ИтогоКонец, "ЧГ=0") + Разделитель;			
		//	
		//	
		//	
		//	ТекстовыйФайлЗапись.ЗаписатьСтроку(ТекстовыйДокумент);
		//КонецЦикла;
		//
		//ТекстовыйФайлЗапись.Закрыть();
		//АдресНаСервере = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
		
		ПолучитьФайл(АдресВоВременномХранилище, ПолноеИмяФайла, Ложь);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан файл: " + ПолноеИмяФайла;
		Сообщение.Сообщить();
		
		//Попытка
		//	УдалитьФайлы(ИмяВременногоФайла);
		//Исключение
		//    //ОписаниеОшибки()
		//КонецПопытки; 
		
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеСпособаДетализации()
	
	Если СпособДетализации = "1" Тогда
		Возврат "по участкам";	
	ИначеЕсли СпособДетализации = "2" Тогда 
		Возврат "по адресам";	
	Иначе	
		Возврат "по лицевым счетам";	
	КонецЕсли; 
	
КонецФункции
 
&НаСервере
Функция ПолучитьМассивНачислений()
	
	МассивНачислений = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Начисления.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивНачислений = Начисления.Выгрузить(,"Начисление").ВыгрузитьКолонку("Начисление");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивНачислений.Добавить(НайденнаяСтрока.Начисление);	
		КонецЦикла; 	
	КонецЕсли; 
	
	Возврат МассивНачислений;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивУчастков()
	
	МассивУчастков = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Участки.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивУчастков = Участки.Выгрузить(,"Участок").ВыгрузитьКолонку("Участок");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивУчастков.Добавить(НайденнаяСтрока.Участок);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивУчастков;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивАдресов()
	
	МассивАдресов = Новый Массив;
	
	МассивАдресов = Адреса.Выгрузить(,"Адрес").ВыгрузитьКолонку("Адрес");
	
	Возврат МассивАдресов;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивВидовОплат()
	
	МассивВидов = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = ВидыОплат.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивВидов = ВидыОплат.Выгрузить(,"ВидОплаты").ВыгрузитьКолонку("ВидОплаты");
	Иначе	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивВидов.Добавить(НайденнаяСтрока.ВидОплаты);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивВидов;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивТиповКвартир()
	
	МассивТиповКвартир = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = ТипыКвартир.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивТиповКвартир = ТипыКвартир.Выгрузить(,"ТипКвартиры").ВыгрузитьКолонку("ТипКвартиры");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивТиповКвартир.Добавить(НайденнаяСтрока.ТипКвартиры);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивТиповКвартир;
	
КонецФункции

&НаКлиенте
Процедура ВидыОплат_УстановитьФлажки(Команда)
	
	Для каждого ВидОплСтрока Из ВидыОплат Цикл
		ВидОплСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыОплат_СнятьФлажки(Команда)
	
	Для каждого ВидОплСтрока Из ВидыОплат Цикл
		ВидОплСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры
 

// Старый запрос

//"ВЫБРАТЬ
//|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК LS,
//|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
//|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор КАК Регистратор
//|ПОМЕСТИТЬ ВТ_Данные
//|ИЗ
//|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
//|			&ДатаНачала,
//|			&ДатаОкончания,
//|			Регистратор,
//|			Организация = &Организация
//|				И УслугаЖКХ В (&Начисления)
//|				И 1 = 1
//|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХОбороты
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
//|		ПО бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//|ГДЕ
//|	НЕ(бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
//|				ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
//|				ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндексаОбщедомовыхЗатрат
//|				ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
//|				ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
//|				ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам)
//|
//|ИНДЕКСИРОВАТЬ ПО
//|	LS,
//|	УслугаЖКХ,
//|	Регистратор
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ РАЗЛИЧНЫЕ
//|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
//|	МАКСИМУМ(бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК ФизЛицо
//|ПОМЕСТИТЬ ВТ_ФИО
//|ИЗ
//|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
//|			&ДатаОкончания,
//|			СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
//|				И ЛицевойСчет В
//|					(ВЫБРАТЬ
//|						ВТ_Данные.LS КАК LS
//|					ИЗ
//|						ВТ_Данные КАК ВТ_Данные)) КАК бит_ПроживающиеПоЛССрезПоследних
//|
//|СГРУППИРОВАТЬ ПО
//|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	бит_ОплатаКУСписокУслуг.Услуга КАК Услуга,
//|	бит_ОплатаКУСписокЛС.лб_ПериодНачисления КАК PER,
//|	бит_ОплатаКУСписокУслуг.Сумма КАК Сумма,
//|	бит_ОплатаКУСписокЛС.Ссылка КАК Ссылка,
//|	бит_ОплатаКУСписокЛС.лб_Примечание КАК PRI,
//|	ВЫРАЗИТЬ(бит_ОплатаКУСписокЛС.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК F,
//|	бит_ОплатаКУСписокЛС.ЛицевойСчет КАК LS,
//|	ПРЕДСТАВЛЕНИЕ(бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры) КАК NKV,
//|	ЕСТЬNULL(лб_ПредставлниеЗданий.Представление, бит_ОплатаКУСписокЛС.ЛицевойСчет.Здание) КАК ADR,
//|	ВЫРАЗИТЬ(бит_ОплатаКУСписокЛС.Ссылка.лб_ВидОплаты КАК Справочник.лб_ВидыОплат) КАК VID,
//|	бит_ОплатаКУСписокЛС.Ссылка.Дата КАК Период,
//|	бит_ОплатаКУСписокУслуг.НомерСтроки КАК НомерСтроки,
//|	ЕСТЬNULL(бит_ОплатаКУСписокУслуг.СуммаПени, 0) КАК СуммаПени
//|ПОМЕСТИТЬ ВТ_Документы
//|ИЗ
//|	Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
//|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
//|		ПО бит_ОплатаКУСписокЛС.Ссылка = бит_ОплатаКУСписокУслуг.Ссылка
//|			И бит_ОплатаКУСписокЛС.ЛицевойСчет = бит_ОплатаКУСписокУслуг.ЛицевойСчет
//|			И бит_ОплатаКУСписокЛС.лб_КлючСтроки = бит_ОплатаКУСписокУслуг.лб_КлючСтроки
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_ПредставлниеЗданий КАК лб_ПредставлниеЗданий
//|		ПО бит_ОплатаКУСписокЛС.ЛицевойСчет.Здание = лб_ПредставлниеЗданий.Здание
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
//|		ПО бит_ОплатаКУСписокЛС.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИО КАК ВТ_ФИО
//|		ПО бит_ОплатаКУСписокЛС.ЛицевойСчет = ВТ_ФИО.ЛицевойСчет
//|ГДЕ
//|	(бит_ОплатаКУСписокЛС.Ссылка, бит_ОплатаКУСписокЛС.ЛицевойСчет, бит_ОплатаКУСписокУслуг.Услуга) В
//|			(ВЫБРАТЬ
//|				ВТ_Данные.Регистратор КАК Регистратор,
//|				ВТ_Данные.LS КАК LS,
//|				ВТ_Данные.УслугаЖКХ КАК УслугаЖКХ
//|			ИЗ
//|				ВТ_Данные КАК ВТ_Данные)
//|	И бит_ОплатаКУСписокЛС.Ссылка.лб_ВидОплаты В(&ВидыОплаты)
//|
//|ИНДЕКСИРОВАТЬ ПО
//|	LS,
//|	Ссылка,
//|	Услуга
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	ВТ_Документы.F КАК F,
//|	ВТ_Документы.LS КАК LS,
//|	ВТ_Документы.NKV КАК NKV,
//|	ВТ_Документы.ADR КАК ADR,
//|	ВТ_Документы.VID КАК VID,
//|	ВТ_Документы.Период КАК MES,
//|	ВТ_Документы.PER КАК PER,
//|	ВТ_Документы.Период КАК DEN,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &SOD_J
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК SOD_J,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &DM_J
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК DM_J,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга В (&A_J)
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК A_J,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &DOP_JY
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК DOP_JY,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &P_J
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК P_J,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &G_J
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК G_J,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &SOD_J
//|				И НЕ ВТ_Документы.СуммаПени = 0
//|			ТОГДА ВТ_Документы.СуммаПени
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК G_PENI,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга В (&GV_J)
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК GV_J,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга В (&OT_J)
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК OT_J,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &PR
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК PR,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга В (&XV_J)
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК XV_J,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &VO_J
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК VO_J,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &GP_JY
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК GP_JY,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &PREDS
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК PREDS,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &KAP_DOP
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК KAP_DOP,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &KAP_MIN
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК KAP_MIN,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &KAP_MIN
//|				И НЕ ВТ_Документы.СуммаПени = 0
//|			ТОГДА ВТ_Документы.СуммаПени
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК KAP_P,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &RFRK
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК RFRK,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &ODN_VO
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК ODN_VO,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &ODN_GV
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК ODN_GV,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &ODN_XV
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК ODN_XV,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &ODN_EL
//|			ТОГДА ВТ_Документы.Сумма
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК ODN_EL,
//|	9 КАК B,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &ААС
//|			ТОГДА 1
//|		КОГДА ВТ_Документы.Услуга = &АПТ
//|			ТОГДА 7
//|		КОГДА ВТ_Документы.Услуга = &АГТ
//|			ТОГДА 6
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК KOD_A,
//|	ВЫБОР
//|		КОГДА ВТ_Документы.Услуга = &ОтоплениеОКСК
//|			ТОГДА 4
//|		КОГДА ВТ_Документы.Услуга = &ОбслуживаниеПУ
//|			ТОГДА 5
//|		ИНАЧЕ 0
//|	КОНЕЦ КАК KOD_T,
//|	ВТ_Документы.PRI КАК PRI,
//|	ВТ_Документы.НомерСтроки КАК НомерСтроки
//|ПОМЕСТИТЬ ВТ_ПоУслугам
//|ИЗ
//|	ВТ_Документы КАК ВТ_Документы
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	ВТ_ПоУслугам.F КАК F,
//|	ВТ_ПоУслугам.LS КАК LS,
//|	ВТ_ПоУслугам.NKV КАК NKV,
//|	ВТ_ПоУслугам.ADR КАК ADR,
//|	ВТ_ПоУслугам.VID КАК VID,
//|	ВТ_ПоУслугам.MES КАК MES,
//|	ВТ_ПоУслугам.PER КАК PER,
//|	ВТ_ПоУслугам.DEN КАК DEN,
//|	СУММА(ВТ_ПоУслугам.SOD_J) КАК SOD_J,
//|	СУММА(ВТ_ПоУслугам.DM_J) КАК DM_J,
//|	СУММА(ВТ_ПоУслугам.A_J) КАК A_J,
//|	СУММА(ВТ_ПоУслугам.DOP_JY) КАК DOP_JY,
//|	СУММА(ВТ_ПоУслугам.P_J) КАК P_J,
//|	СУММА(ВТ_ПоУслугам.G_J) КАК G_J,
//|	СУММА(ВТ_ПоУслугам.G_PENI) КАК G_PENI,
//|	СУММА(ВТ_ПоУслугам.GV_J) КАК GV_J,
//|	СУММА(ВТ_ПоУслугам.OT_J) КАК OT_J,
//|	СУММА(ВТ_ПоУслугам.PR) КАК PR,
//|	СУММА(ВТ_ПоУслугам.XV_J) КАК XV_J,
//|	СУММА(ВТ_ПоУслугам.VO_J) КАК VO_J,
//|	СУММА(ВТ_ПоУслугам.GP_JY) КАК GP_JY,
//|	СУММА(ВТ_ПоУслугам.PREDS) КАК PREDS,
//|	СУММА(ВТ_ПоУслугам.KAP_DOP) КАК KAP_DOP,
//|	СУММА(ВТ_ПоУслугам.KAP_MIN) КАК KAP_MIN,
//|	СУММА(ВТ_ПоУслугам.KAP_P) КАК KAP_P,
//|	СУММА(ВТ_ПоУслугам.RFRK) КАК RFRK,
//|	СУММА(ВТ_ПоУслугам.ODN_VO) КАК ODN_VO,
//|	СУММА(ВТ_ПоУслугам.ODN_GV) КАК ODN_GV,
//|	СУММА(ВТ_ПоУслугам.ODN_XV) КАК ODN_XV,
//|	СУММА(ВТ_ПоУслугам.ODN_EL) КАК ODN_EL,
//|	ВТ_ПоУслугам.B КАК B,
//|	МАКСИМУМ(ВТ_ПоУслугам.KOD_T) КАК KOD_T,
//|	МАКСИМУМ(ВТ_ПоУслугам.KOD_A) КАК KOD_A,
//|	ВТ_ПоУслугам.PRI КАК PRI,
//|	ВТ_ПоУслугам.НомерСтроки КАК НомерСтроки
//|ИЗ
//|	ВТ_ПоУслугам КАК ВТ_ПоУслугам
//|
//|СГРУППИРОВАТЬ ПО
//|	ВТ_ПоУслугам.F,
//|	ВТ_ПоУслугам.LS,
//|	ВТ_ПоУслугам.NKV,
//|	ВТ_ПоУслугам.ADR,
//|	ВТ_ПоУслугам.VID,
//|	ВТ_ПоУслугам.MES,
//|	ВТ_ПоУслугам.DEN,
//|	ВТ_ПоУслугам.B,
//|	ВТ_ПоУслугам.PRI,
//|	ВТ_ПоУслугам.НомерСтроки,
//|	ВТ_ПоУслугам.PER
//|
//|УПОРЯДОЧИТЬ ПО
//|	F,
//|	LS,
//|	NKV,
//|	PER"
